[
  {
    "name": "Dress : Bodycon Black Mini - 1",
    "product_text": "Title:\nANRABESS Womens Fall Long Sleeve Short Dress Rib Knit 2025 Fashion Basic Slim Fit Party Cocktail Night Bodycon Mini Dresses\n\nProduct details\nTop highlights\nFabric type95%Rayon 5%Elastane\nCare instructionsMachine Wash\nOriginImported\nClosure typePull On\nAbout this item\nFit Type - Slim.Size down if between Bust sizes.\nSize - XS=US(0-2),S=US(4-6), M=US(8-10), L=US(12-14), XL=US(16-18). More details in rich description.\nMaterial - 95%Rayon 5%Elastane. Stretch - Medium, Thickness - Medium, Softness - Soft.\nWashing - Machine wash cold gently with like colors. Do not bleach or iron.\nFeatures - Women's Casual lightweight bodycon dress, crewneck, long sleeve.This women's dresses perfect for daily, work, office, business wear, making you look confident and stylish wherever you go.\nStyle\nColor\tBlack\nPattern\tSolid\nOccasion Type\tClub, Dating, Holiday, Night Out, Party\nApparel Silhouette\tBodycon\nNeck Style\tCrew Neck\nSleeve Type\tLong Sleeve\nStyle Name\tSoft\nApparel Closure Type\tPull On\nBack Style\tBackless\nStrap Type\tShoulder\nWaist Style\tMid Waist",
    "product_image_url": "https://m.media-amazon.com/images/I/714yg-qAdoL._AC_SY741_.jpg",
    "added_at": "2026-03-01T15:15:46.968Z"
  },
  {
    "name": "Dress : Bodycon Black Maxi - 1",
    "product_text": "Title:\nLILLUSORY Womens Summer Casual Slip Dresses Spaghetti Strap Double Lined Bodycon Maxi Dress\n\nProduct details\nTop highlights\nFabric type95%Polyamide 5%Spandex\nCare instructionsMachine Wash\nOriginImported\nClosure typePull On\nAbout this item\nButtery Soft & Figure-Defining Fabric: Crafted from 95% polyamide and 19% spandex, this bodycon maxi dress offers a luxurious, buttery-soft feel with just the right amount of stretch. The double-layered construction adds support and opacity, ensuring a flattering fit that highlights your silhouette.\nOn-Trend Double-Layered Design: Featuring delicate spaghetti straps and a double-lined build, this dress stands out from ordinary maxis with its modern, chic aesthetic. The layered fabric combines effortless comfort with a touch of elegance and charm, making it both versatile and sophisticated.\nPair it with flat shoes and a shoulder bag for a laid-back, everyday look, or dress it up with heels, bold accessories, and a pop of color for a stunning party outfit. Perfect for wearing alone in spring and summer or as a sleek underlayer in cooler seasons. Ideal for various occasions: parties, weddings, homecomings, clubs, outings, beaches, and graduations.\nSize: Please Refer To Size Chart For Details Before Purchase Which We Provide In Our Pictures\nMACHINE WASH COLD, TUMBLE DRY LOW: we recommend machine washing with laundry bag on cold.",
    "product_image_url": "https://m.media-amazon.com/images/I/41dICcJ5pJL._AC_SY741_.jpg",
    "added_at": "2026-03-01T15:16:41.174Z"
  },
  {
    "name": "Dress : Mini Plunging Neckline 1",
    "product_text": "XinFSh Women's Sexy Fall Long Sleeve Mini Dress V Neck A-Line Corset Short Party Cocktail Dresses\n\nProduct details\nTop highlights\nFabric type97%Polyester，3%Elastane\nOriginImported\nClosure typePull On\nNeck styleV-Neck\nAbout this item\nMaterial:This long sleeve mini dress is made from soft, slightly stretchy fabric that provides all-day comfort while maintaining the dress's structure and drape\nFeature:long sleeve cocktail dress for women/fall mini dress/corset dress for women/a line mini dress/short flowy dress/deep v neck dress/little black dress/plunging neckline dress/longsleeve dresses for women 2025/mini dresses for women sexy/all white party outfits for women/fit and flare dress for women/long sleeve dress for women sexy\nDesign:Designed to complement various body shapes, the sexy dresses for women date night offers a flattering fit that enhances your natural curves. Its pleated design adds texture and visual interest, creating a slimming effect\nMatching:Ideal for both casual outings and formal events, this fit and flare dress for women transitions seamlessly from day to night. Pair it with sneakers for a laid-back look or dress it up with heels and accessories for a chic evening ensemble.Suitable for fall & winter\nOccation:party dress/sexy short cocktail dresses for women/birthday dress/semi formal dresses for women/women's club & night out dresses/club dresses for women/going out dresses for women/date night dresses for women/graduation dress/night out dresses for women/burgundy holiday dress for women",
    "product_image_url": "https://m.media-amazon.com/images/I/615ijFkMCdL._AC_SX679_.jpg",
    "added_at": "2026-03-01T15:24:03.409Z"
  },
  {
    "name": "Dress : Maxi Plunging Neckline 2",
    "product_text": "WDIRARA Women's Plunging Deep V Bandage High Split Sexy Dress Solid Bodycon Maxi Dress\n\nProduct details\nTop highlights\nFabric type94% Viscose,6% Elastane\nCare instructionsHand Wash Only\nOriginImported\nClosure typePull On\nAbout this item\nFeatures: maxi dress, solid color, plunging deep v neck, high split on both sides, sleeveless, bodycon dress, sexy and slinky\nFabric has some stretch,and it's soft and comfortable\nOccasion: Perfect for club, party, night out, vacation, travel, shopping, evening, birthday, street, beach, going out, festival, dinner gathering, and other leisure occasion\nStyle: Tailored in a slim-fit silhouette, this maxi dress has a sexy deep v neck and high split on both sides to accentuate your silhouette and glamour in a perfect way, plain as it is, this bodycon maxi dress will make you much more outstanding among the crowds\nPlease refer to size measurement in the last item picture before ordering",
    "product_image_url": "https://m.media-amazon.com/images/I/512P2mJbRlL._AC_SY741_.jpg",
    "added_at": "2026-03-01T15:24:54.230Z"
  },
  {
    "name": "Dress : Midi Sheath Sleeveless 1",
    "product_text": "Women Business Sheath Midi Dress, 2025 Summer Sleeveless A-line Slimming Work Pencil Skirt\n\nProduct details\nTop highlights\nFabric type95% Polyester, 5% Spandex\nCare instructionsHand Wash Only; Machine Wash\nOriginImported\nClosure typeZipper\nAbout this item\nSize Tip: Here is our updated size chart and sizing design. Please check it before placing your order and choose the size that fits you best.\nFabric:Our dress is made of breathable and lightweight materials, ensuring you stay cool and sweat free all day long. Please check the size chart before placing an order!\nFlattering & Unique Design:The pencil skirt fits snugly against the body, with a slim fit for easy walking. Make you both elegant and sexy.\nOccasions:Perfect for women's work, business gatherings, offices, casual wear, job interviews, churches, dinner dates, cocktail parties, graduation ceremonies, spring and autumn funerals.\nCaution:Machine wash with cold water, gently machine wash, hang or air dry. [Remember to separate colors and avoid bleaching when washing]",
    "product_image_url": "https://m.media-amazon.com/images/I/61Im2B89amL._AC_SX569_.jpg",
    "added_at": "2026-03-01T15:27:11.742Z"
  },
  {
    "name": "Dress : A-line short sleeve Midi 1",
    "product_text": "Women's Cocktail Dress Wrap V Neck Ruffle Short Sleeve A Line Work Formal Wedding Guest Midi Dress with Pockets\n\nProduct details\nTop highlights\nFabric typePonte\nCare instructionsMachine Wash, Hand Wash Only\nOriginImported\nClosure typeZipper\nAbout this item\nFlattering Ruffle Sleeve Dress: This wrap v neck cocktail dress is made by stretchy fabric which is comfortable for wear all day, skin-friendly and not see through. Midi dress for women with pockets.\nGorgeous Fit and Flare Dress: Semi formal dresses for women, wrap v neck with ruched details, flutter ruffles sleeves,functional side pockets. Fit and flare skater party dress, swing dresses for women, midi work dresses for women.\nClassy Wedding Guest Dress: This women’s flared casual party dress is cute and elegant, well cut to hugs your curves perfectly, flowing midi skirt draped nicely to accentuates your feminine. Flutter sleeves are great to hide your arm fat. The wrap v neck shows just the right amount of cleavage. Cute homecoming dresses for teen girls, formal wedding guest dresses for women, suitable for all seasons, casual summer women dresses.\nDress It Up or Down : Classy women’s fit and flare cocktail dress can be dressed up or down with different accessories, such as office wear to work, business party, wedding guest, formal event, wedding reception, church, teacher, brunch, date, dinner, fall wedding guest, cocktail party, vacation, house around, daily wear, birthday, graduation, homecoming, interview or other special occasions.\nGarment Care: Size guide on the last product image for reference, or please contact us if your are not sure what size to get. Hand Wash or Machine Wash in Low Temperature water, Hang to Dry.",
    "product_image_url": "https://m.media-amazon.com/images/I/51-gFU4gWuL._AC_SX679_.jpg",
    "added_at": "2026-03-01T15:28:22.543Z"
  },
  {
    "name": "Dress : Maxi Mesh Floral 1",
    "product_text": "GothDark Women's Mesh Dress Short Sleeve Round Collar Floral Print High Slit Waist-Cinched Wedding Guest Maxi Dresses\n\nProduct details\nTop highlights\nFabric type95% Polyester, 5% Elastane\nCare instructionsMachine Wash\nOriginImported\nClosure typePull On\nAbout this item\nSize - S=US(4-6), M=US(8-10), L=US(12-14), XL=US(16-18). Please see details in rich description. A flowy lined maxi dress with a high slit, suitable for vacations, dinners, parties, and special occasions. Thigh-high slit measures about 24.5 inches. Lining ends 16 inches above the hem\nMaterial - Made of 95% polyester, 5% elastane, the fabric is soft, comfortable and Stretchy. With a soft black lining, it provides modesty and all-day comfort. The side with the visible seam is the back of the dress, and the front is smooth with the floral pattern\nFeatures - Short sleeve, high neck, high waist, maxi length, high slit, dark floral print, floral maxi dress, black mesh dress, a line, goth dress, vintage dress, flowy dress, romantic dress, flower dress, suitable for both casual and formal looks\nOccasions - Suitable for many events, such as cocktail party, wedding guest, graduation, birthday, beach, homecoming, prom, holiday, tea party, concert, club, Valentine’s Day and even daily wear, effortlessly blending elegance and drama into everyday life\nWashing - Made with a lined mesh design for coverage, Machine wash or hand wash, no bleach, hang or line dry, low iron when necessary. Proper care keeps this floral wedding guest dress in good condition for everyday wear and event styling",
    "product_image_url": "https://m.media-amazon.com/images/I/61qTyLpYcvL._AC_SY741_.jpg",
    "added_at": "2026-03-01T15:29:55.477Z"
  },
  {
    "name": "Top : Square Neck Sleeveless Top",
    "product_text": "Trendy Queen Womens Double Lined Tank Tops Crop Summer Fashion Clothing 2026\n\nProduct details\nTop highlights\nFabric type88% Polyester, 12% Spandex\nCare instructionsMachine Wash\nOriginImported\nClosure typePull On\nAbout this item\nTrendy Collection: Weave the pulse of the street into every stitch—slip it on and wear the “now” like a spotlight We call it “Trendy” because the fabric comes with its own algorithm: the moment you move, cameras autofocus and the feed refreshes with you as the headline.\nDouble–Layer Fabric: This women’s tank is built with two whisper-light layers that stay 100% opaque yet let the breeze through when the mercury climbs. Hyper-stretch, cloud-soft yarn gives you second-skin comfort and total freedom to move\nDesign: Precision-tailored square neckline and razor-clean straps map the natural lines of your shoulders and collarbone, carving out a sleek, confidence-high silhouette\nWardrobe MVP: The sleeveless silhouette is the ultimate warm-weather chameleon—dress it down with denim or up with a blazer. One top, endless looks\nFrom Desk to Dusk: Whether it’s coffee runs, boardroom meetings or after-dark rooftop scenes, this piece shape-shifts to fit the moment—your perennial style ace",
    "product_image_url": "https://m.media-amazon.com/images/I/61Dpulp6GbL._AC_SY741_.jpg",
    "added_at": "2026-03-01T15:31:11.240Z"
  },
  {
    "name": "Top : Square Neck Sleeveless Plunging Top",
    "product_text": "REORIA Butsmooth® Women's Square Neck Going Out Crop Tops Double Lined Cute Basic Tank Tops 2026 Clothes\n\nProduct details\nTop highlights\nFabric type84%Polyester/16%Spandex\nCare instructionsMachine Wash\nOriginImported\nClosure typePull On\nAbout this item\n🌸Size Guide (Slim Fit): XS=US 0-2 | S=US 4-6 | M=US 8-10 | L=US 12-14 | XL=US 16-18 | XXL=US 20-22\n🌸Fit Note: This crop top runs snug. If you have a fuller bust or prefer a looser fit, we recommend ordering one US size up from your usual size. Example: US 4→US 6 | US 6→US 8 | US 8→US 10 | US 10→US 12 (Continues accordingly)\n🌸Material: Buttery-soft and cloud-light, our premium stretch fabric hugs your curves in all the right places. The supportive, smoothing stretch eliminates seams and wrinkles, giving you a sleek silhouette that feels as effortless as it looks.\n🌸Design: Elevate your summer style with our cropped tops for women - the epitome of trendy fashion. The square neck tank top exudes both sophistication and allure, making it an ideal choice for your sexy going-out looks. Our cropped tank tops, designed with a double-lined feature, provide a sleek and figure-flattering silhouette.\n🌸Occasion: These trendy tops are not just stylish but also perfect for a range of occasions – from a night out to yoga and running sessions. The versatile style ensures you can effortlessly transition from casual daywear to an evening ensemble.",
    "product_image_url": "https://m.media-amazon.com/images/I/61aG7TjqjxL._AC_SY741_.jpg",
    "added_at": "2026-03-01T15:32:30.441Z"
  },
  {
    "name": "Sweater : Oversized turtleneck",
    "product_text": "Mafulus Women's Oversized Crewneck Sweater Batwing Puff Long Sleeve Cable Slouchy Pullover Jumper Tops\n\nProduct details\nTop highlights\nFabric typeFitted\nCare instructionsMachine Wash\nClosure typePull On\nWeave typeRib\nAbout this item\nMaterial:Core spun yarn Knit & Cotton.Super soft,stretchy and lightweight,Classy high quality.This solid color sweater woven with a fine and lightweightknit perfect for easy-going everyday wear, breathable and elastic knitted fabric creates a relaxed fit\nFeatures： Lightweight, Loose Boyfriend Pullover Solid Drop shoulder,Crew neck,Long Sleeve,Lantern Sleeve,Ribbed cuffs,Solid Color,Batwing sleeves added femininity, loose design help hide your belly, is good for any body type\nElegant casual style suitable for both women and girls, perfect to pair with shorts, pants, skirt, jeans, ankle boots ect.\nWashable : Recommended to wash with Cold Water, Do Not Bleach, machine wash with laundry bag is available\nNote: our actual size differ from Amazon size standard, please refer to size measurement in product description before purchase. Due to the difference between different monitors, the picture may not reflect the actual color of the item.",
    "product_image_url": "https://m.media-amazon.com/images/I/71sO3AUVrNL._AC_SY741_.jpg",
    "added_at": "2026-03-01T15:34:51.060Z"
  },
  {
    "name": "Sweater : Oversized vneck",
    "product_text": "BZB Women's V Neck Long Sleeve Knit Loose Oversized Pullover Sweater Top\n\nProduct details\nTop highlights\nFabric type80% Cotton, 20% Nylon\nCare instructionsMachine Wash, Hand Wash Only\nClosure typePull On\nWeave typeRibbed,Waffle\nAbout this item\nMaterial:60% Acrylic 20% Cotton,Soft and Comfortable.\nBust: S-44.49 inch,M-46.46 inch,L-48.82 inch,XL-51.18 inch,2XL-53.54 inch.Model is Wearing a Size Small. Height is 5'7\", Bust is 32?, Waist 25?, and Hips 30?.\nFeature: The waffle knit top fashioned with a front/back v-neck,long sleeve,ribbed edges and loose style to incorporate a subtle feminine touch.It can easily wear as a one shoulder, off the shoulder, or classic v-neck pullover!\nMatching: Easy to pair it with jeans,pants,skinny leggings,shorts and high boots.This oversized pullover sweater suitable for casual, work,shopping,office, home, street,party and daily wear.\nGarment Care: Machine wash / hand wash in cold water, do not bleached.",
    "product_image_url": "https://m.media-amazon.com/images/I/61oya+C8a-L._AC_SX679_.jpg",
    "added_at": "2026-03-01T15:36:19.675Z"
  },
  {
    "name": "Top : Fitted Blouse 1",
    "product_text": "Blooming Jelly Women's Dressy Casual Blouses Business Ruffle Short Sleeve Tops Summer Crew Neck Smocked Shirts\n\nProduct details\nTop highlights\nFabric type95% Polyester, 5% Spandex，soft, breathable fabric.\nCare instructionsMachine Wash\nOriginImported\nClosure typePull On\nAbout this item\nSoft Material: The dressy casual blouses made of 95% polyester, 5% spandex, easy to care, lightweight, soft and skin-friendly, comfortable and breathable, but a little see-through, especially white and light colours, lightweight and breathable tops keep you cool and comfy on the hot summer，create a flattering and charming look.\nFlattering Feature: The business casual outfits features with stretchy smocked waist, slim the wastied cave, cute ruffle short sleeve, crew neck, back keyhole closure, solid color, underarm gusset, fashionable and elegant, highlighting the confident charm of women.\nEasy to Match: Womens work tops is suitable for summer wear. You can pair this dressy tops with variety of coats, shirts, jacket, jeans, denim shorts, skirts, jeggings, sneakers or heels to complete a chic and trendy look.\nVersatile Occassion: Womens summer tops is perfect choice for your daily wear, outdoor activities, shopping, dates, office, work, vacation and any other occasions in Spring, Summer and Fall.\nNote: The bust, waist and hip size are based on body measurement, not product´s measurement. Please measure your body size before ordering, and then refer to our size chart to choose the right size, S=US 2-4, M=US 6-8, L=US 10, XL=US 12",
    "product_image_url": "https://m.media-amazon.com/images/I/81NH8FDgtvL._AC_SX569_.jpg",
    "added_at": "2026-03-01T15:37:31.811Z"
  },
  {
    "name": "Top : Fitted Wrap dress 3/4 sleeve",
    "product_text": "GRACE KARIN Women's Dressy Casual Wrap Tops,V Nevk Business Work Blouses,3/4 Sleeve Fitted Slim Formal Shirts\n\nProduct details\nTop highlights\nFabric type95% Polyester, 5% Elastane\nCare instructionsMachine Wash\nOriginImported\nFur description95%Polyester,5%Elastane\nAbout this item\nSTYLISH DESIGN: Women's wrap V-neck 3/4 sleeve fall top has a ruched waist design that can accentuate your body curves. The asymmetric hem design is more unique and gives you an elegant feel. Elegant and simple, this casual elegant ruched work top is sure to be a window must-have\nMULTIPLE COLORS: Black Casual Business Blouse Tops/Fall Apricot 3/4 Sleeve Work Tops/Collared V Neck Dark Red Blouse Tops/Grey Blue Ruched Wrap Blouse Shirts/Dark Red Tank Top for Women/Asymmetrical Hem Elegant Teal Top.This 3/4 sleeeve wrap dressy top is made of 95%Polyester,5%Elastane\nMATCHING: Fall collared casual blouses are suitable for all body types.You can show off your amazing charm by matching it with jeans, trousers, hip-hugging skirts, heels, leather shoes, casual shoes, etc\nOCCASION: Elegant 3/4 sleeve top is perfect for shopping, working, traveling, going out, holidays, dating, outdoors, leisure, daily wear, birthday party, and photography show\nTIPS: Please check the size chart carefully and choose the right size before placing an order.Machine washable, hand wash recommended with low-temperature water, using a mild gentle soap, no bleach",
    "product_image_url": "https://m.media-amazon.com/images/I/71GIEmubqiL._AC_SX569_.jpg",
    "added_at": "2026-03-01T15:39:07.010Z"
  },
  {
    "name": "Pants : High waisted wide leg",
    "product_text": "ODODOS Chiffon Flowy Pleated Wide Leg Pants for Women Lightweight High Waist Trouser with Pockets-27/29\" /31\" Inseam\n\nProduct details\nTop highlights\nFabric type100% Polyester\nCare instructionsMachine Wash\nOriginImported\nClosure typePull On\nAbout this item\nOffice-to-Weekend Style: Designed with a polished wide-leg silhouette that transitions easily from work to casual outings.\nSmooth Structured Fabric: Soft yet slightly structured material offers a refined drape, breathable comfort, and a crisp look that holds its shape.\nHigh Waist Design: Front pleats, belt loops, and elastic back waistband create a secure, flattering fit that moves with you.\nFunctional Side Pockets: Two convenient pockets for storing essentials like phone, keys, or wallet.\nElegant Wide-Leg Fit: Flowing cut lengthens the leg line and pairs effortlessly with blouses, blazers, or casual tops.",
    "product_image_url": "https://m.media-amazon.com/images/I/61f10AMiG-L._AC_SY741_.jpg",
    "added_at": "2026-03-01T15:40:44.772Z"
  },
  {
    "name": "Pants : High waisted pencil leg",
    "product_text": "GRACE KARIN Womens Casual High Waist Pencil Pants with Pockets Bow-Knot Cropped Paper Bag Pants for Work\n\nProduct details\nTop highlights\nFabric type95% Polyester, 5% Elastane\nCare instructionsMachine Wash / Hand Wash\nOriginImported\nClosure typePull On\nAbout this item\nComfy fabric: GRACE KARIN soft casual pants are a year-round wardrobe staple,flexible to style and ensure day-long comfort and elegance\nFeatures: These ankle length high waisted pencil pants feature a pull-on closure with belt loops, the included matching belt is removable. Practical side pockets are paired with adjustable tie-off leg openings that let you style as you desire\nStyle\nColor\tBlack\nStyle Name\tClassic\nRise Style\tHigh Rise\nLeg Style\tAnkle\nFit Type\tRegular\nPattern\tSolid\nPattern Style\tSolid\nPants Form Type\tSlacks\nOccasion Type\tShopping,Casual,Holiday,Winter,Date,Vacation\nSeasons\tAll\nApparel Closure Type\tPull On\nFront Pleat Type\tFlat Front\ncharacter\tGirls",
    "product_image_url": "https://m.media-amazon.com/images/I/61It9+qe3NL._AC_SX569_.jpg",
    "added_at": "2026-03-01T15:41:42.394Z"
  },
  {
    "name": "Pants : Mid rise skinny jeans",
    "product_text": "Angels Forever Young Evershape Skinny Jeans For Women - Mid-rise​​, Figure Enhancing Stretch Denim\n\nProduct details\nTop highlights\nFabric type57% Cotton, 21% Rayon, 20% Polyester, 2% Spandex\nCare instructionsMachine Wash\nOriginImported\nClosure typeButton\nAbout this item\nUplifting and shaping - Angels Forever Young Evershape Women’s Skinny Jeans feature an extra wide high-rise stacked waistband sculpts and elongates for a fitter look. Paired with stretch and soft denim construction for the best-fitting, most comfortable skinny jeans you will ever wear.\nStylish and functional - These high-waisted jeans for women are accentuated with a modern 3-button closure and whiskered hips for that ideal distressed look. Faux front pockets provide a smooth, streamlined look.\nClassic, sleek skinny - Make a statement with skinny women's jeans that have just the right amount of stretch to flatter your curves from waist to ankle. The 2000s are so back, now so much more comfortable.\nGet the perfect fit - Find your missy or plus size jeans for women. Our innovative fit enhancements are designed to forever enhance, lift, & sculpt because we know feeling and looking confident on the outside will help you feel confident and empowered on the inside.\nECO Love - Join our journey to more eco-friendly processes for more sustainable garments. By 2026, we aim to source 50% of our cotton through the Better Cotton program—supporting water-efficient farming practices that benefit both farmers and the environment.\nSee lessAbout this item\nStyle\nColor\tBerkeley Legacy\nStyle Name\tEvershape Skinny Jeans\nRise Style\tHigh Rise\nLeg Style\tSkinny\nFit Type\tSkinny\nPattern\tSolid\nPattern Style\tSolid\nPants Form Type\tJeans\nOccasion Type\tConstruction,Casual\nSeasons\tFall\nApparel Closure Type\tButton\nFront Pleat Type\tFlat Front\nApparel Closure Orientation\tFront\ncharacter\tOccupational professional",
    "product_image_url": "https://m.media-amazon.com/images/I/71Ols5xZESL._AC_SX679_.jpg",
    "added_at": "2026-03-01T15:43:45.086Z"
  },
  {
    "name": "Dress : Bodycon Green",
    "product_text": "Satin Prom Dress Corset Prom Long A Line Pleated Bridesmaid Backless Formal Spaghetti Strap for Gowns\n\nProduct details\nTop highlights\nFabric typeSatin\nCare instructionsHand Wash Only\nClosure typePull On\nNeck styleV-Neck\nAbout this item\nMaterial:High-quality satin material with a luxurious sheen perfect for formal events like proms weddings or evening galas\nStyle:Flattering Corset & A-Line DesignSlimming corset bodice and A-line pleated skirt enhance curves while providing comfort and effortless movement Delicate spaghetti straps and a thigh-high slit add modern elegance balancing sophistication with subtle allure\nOccasion:Back to school dance party graduation ceremony cocktail party Quinceanera Evening parties bridesmaids beauty pageants engagements clubs banquets evening parties dances birthdays holidays and other special formal and semi formal occasions\nSize:Please purchase a suitable skirt according to the size chart\nAfter Sales:If you have any questions please feel free to contact us we will do our best to solve for you\n\nStyle\nColor\tDusty Sage\nPattern\tSolid\nOccasion Type\tWedding, beach events, cocktail parties, evening galas, school dances\nApparel Silhouette\tA-line\nNeck Style\tV-Neck\nSleeve Type\tSleeveless\nSeasons\tAll\nStyle Name\tModern\nApparel Closure Type\tPull On\nBack Style\tBackless\nStrap Type\tSpaghetti\nPattern Style\tSolid\nWaist Style\tFitted\n",
    "product_image_url": "https://m.media-amazon.com/images/I/51wp4djZ7BL._AC_SY741_.jpg",
    "added_at": "2026-03-01T15:46:13.722Z"
  },
  {
    "name": "Pants : High waisted wide leg Jeans",
    "product_text": "Women's Wide Leg Jeans High Waisted Baggy Straight Leg Loose Stretchy Casual Denim Pants\n\nProduct details\nTop highlights\nFabric type56%Cotton, 42%Polyester, 2%Elastane\nCare instructionsHand Wash, Tumble Dry Low\nOriginImported\nClosure typeZipper\nAbout this item\nFit Tips: Our Women jeans run true to standard US sizes. For the best fit,we will recommend referring to our size chart. If you prefer a looser fit, it will be a great choice.\nUnique Design: The baggy jeans for women design with high rise, wide leg, loose fit,YKK zipper and basic five pockets. The loose trouser legs can play a role in modifying the shape of legs and elongating the height.\nStylish and Versatile: The wide leg jeans women with unique design, which highlight the perfect body proportions and make the overall look more personalized.\nComfortable:Our high-waisted jeans are made of soft, breathable, and stretchy denim, which means they may be comfortable at first, but the longer you wear them, the more comfortable they become.\nNote: Hand wash or machine wash cold delicate cycle, Wash inside out with like colors, don’t bleach, tumble dry low, Cool iron if needed.\nSee lessAbout this item\nStyle\nColor\tDark Blue\nStyle Name\tClassic\nRise Style\tHigh Rise\nLeg Style\tWide\nFit Type\tRegular\nPattern\tSolid\nPants Form Type\tJeans\nApparel Closure Type\tZipper\nFront Pleat Type\tFlat Front\n",
    "product_image_url": "https://m.media-amazon.com/images/I/61yDRY3Sh5L._AC_SX679_.jpg",
    "added_at": "2026-03-01T15:47:26.782Z"
  }
]